Revit 2024 API
AirHeatingCoilType Enumeration
 The type of air heating coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public enum AirHeatingCoilType
Visual Basic
Public Enumeration AirHeatingCoilType
Visual C++
public enum class AirHeatingCoilType
Members
Member name | Description
None
ElectricResistance
Furnace
HotWater
See Also
Autodesk.Revit.DB.Mechanical Namespace